In [1]:
##enumerate함수: 열거하다.
##많은 양의 데이터인 list를 다룰 때 편리하게 쓸 수 있는 기능을 제공
##for-each, for
#for x in list(포이치문): 리스트에 있는 것들을 하나씩 꺼내서 처리하기에 아주 간단
#                         index가 없어서 불편
#                         하나씩 꺼내서 출력, 연산하기는 용이
#                         리스트에 입력은 안된다.
# for i in range(n)(원래포문):리스트의 입력과 출력이 다 됨.
#                             인덱스로 리스트에 있는 값들을 접근해야하기 때문에 
#                             코드가 복잡하게 보인다.

In [18]:
# 주요 라이브러리 import
import warnings
warnings.filterwarnings(action='ignore')
import time
from IPython.display import Image
from sklearn.datasets import fetch_openml
import sklearn.datasets as data
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
num_list = [100,200,300]

In [4]:
for x in num_list:
    print(x+100)

200
300
400

In [6]:
for x in enumerate(num_list):#enumerate:튜플로 인덱스가 붙어서 나오게 해준다.
    print(x)

(0, 100)
(1, 200)
(2, 300)

In [8]:
for i,x in enumerate(num_list):#enumerate:튜플로 인덱스가 붙어서 나오게 해준다.
    print(i,':',x)#i에 인덱스 넣고 x에 값 넣어서 출력

0 : 100
1 : 200
2 : 300

In [9]:
for i,x in enumerate(num_list):#enumerate:튜플로 인덱스가 붙어서 나오게 해준다.
    num_list[i] = x+100

In [10]:
#포이치문은 인덱스가 없어서 리스트값을 바꾸는게 불가능했는데
#enumerate함수를 사용하면 가능해진다.
num_list

[200, 300, 400]

In [11]:
from sklearn.model_selection import KFold

In [12]:
kfold = KFold(n_splits=5)

In [14]:
titanic = pd.read_excel('./titanic.xls')

In [17]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"